{ "name": "Abuse", "description": "This includes abusive call, abusive text, abusive txt, harassment, malicious, nuisance." }
{ "name": "Account Management", "description": "Managing of Cellular Voice, Fibre or Mobile Data service accounts for a telecommunications company's customers from the customer's perspective. This includes Change Account Details, MSISDN change, proof of usage, and Transfer of Ownership." }
{ "name": "Billing", "description": "Billing referring to statements and/or invoices for customer accounts of a Telecommunications Company. This includes Account  Payment, Billing Enquiry, Call Barring, Itemised Billing, and Payment Arrangement." }
{ "name": "Brand", "description": "When certain Brand names are mentioned specifically in the comments received from customers, for example: Vodacom, MTN, Telkom, Cell C, Rain, or other competitors." }
{ "name": "Cancellation", "description": "When customers cancel their service with us and request to close their account. This includes Cancellation Enquiry, MNP Port Enquiry, and PIN / PUK Enquiry." }
{ "name": "Call Center", "description": "The customer service team that operates the customer service Call Centre line. This includes Customer Care enquiry." }
{ "name": "Customer's Feeling", "description": "When customers only give short answers, many times it is referring to how they feel. For example: Good, Happy, Not Happy, etc." }
{ "name": "Devices", "description": "This refers to telecomunication devices, like phones or fixed fibre devices or Mobile data dongles or routers. Includes Blacklist/Unblacklist Device, Delivery Enquiry, Handset Enquiry, insurance, proof of purchase, return, stolen, unwanted, Upgrade Enquiry, and Vodacom Repair - Complaint" }
{ "name": "Network Coverage", "description": "This Network refers to the Mobile telecommunications network. Includes Coverage, Signal, Reliability, Speed, Internet, and loadshedding" }
{ "name": "Policy", "description": "This refers to Vodacom policies and procedures that customers make comments about. Includes admin fee, Authentication, Request for Credit Refund, Fraud, and Proof of Payment." }
{ "name": "Price Plans", "description": "Price plans relate to the pricing that Vodacom has for their customers and any comments made around the pricing by customers. Includes Charge Dispute, Deal Match, discount, Tariff Enquiry, and Fee change." }
{ "name": "Products", "description": "These are the products being sold which refers to contracts, prepaid, and postpaid, bundles and specific packages for social media etc. Includes Contract, Data Bundle Enquiry, entertainment packs, International Roaming Enquiry, my vodafone family, prepaid, and top up" }
{ "name": "Resolution", "description": "This refers to whether a customer's issue has been resolved or not and what the issue was relating to. Includes Account Query, and complaint." }
{ "name": "Response", "description": "This refers to the customer receiving (or not receiving) a response from an agent or department in Vodacom." }
{ "name": "Service", "description": "Service refers to when customers only mentions service without putting context around it being network service or customer service that they are referring to." }
{ "name": "Services", "description": "These are the services that Vodacom provide to their customers. Includes Airtime Advance, Parental Control, ivr, Just4You, live chat, Locking/Unlocking, My Vodacom app, NXT LVL, System: Down/Not Available, Tobi, USSD Enquiry, Video Play, Vodacom Online, VodaPay, and voicemail." }
{ "name": "SIM", "description": "SIM is a Sim card inserted into a phone that is provided by Vodacom and connects the customer to the network. Includes activation, and sim." }
{ "name": "Staff Level", "description": "Staff Level here refers to the level of service the agents had provided to the customer. Includes assistance & helpfulness, Broken Arrangement, call back, Call Transferred, communication, Dropped Calls, efficiency, explanation, friendliness & care, hold, inconsistency, language, listening, misinformation, politeness, previous staff behavior, professionalism, Sales Enquiry, staff behavior, understanding, Vodacom Shop, and wait time" }
{ "name": "Other", "description": "For any comments that are not able to be classified." }